
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
    НастройкиСкд = СформироватьНастройкиСКД(Расшифровка); 
	ПараметрыФормыРасшифровки = Новый Структура("настройкиСкд", НастройкиСкд);
	
	Если НастройкиСкд.ДополнительныеСвойства.ВариантРасшифровки = "Выручка"  Тогда
		
		ОткрытьФорму("ВнешнийОтчет.ОтчетБДРСКД_.Форма.ФормаРасшифровкиВыручка", ПараметрыФормыРасшифровки,,,,,);
		
	иначе          
		
		ОткрытьФорму("ВнешнийОтчет.ОтчетБДРСКД_.Форма.ФормаРасшифровкиСчета", ПараметрыФормыРасшифровки,,,,,);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеРасшифровки(Расшифровка)
	
	ДанныеРасшифровкиОбъект = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 
	МассивПолей = БухгалтерскиеОтчетыВызовСервера.ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровкиОбъект, Отчет.КомпоновщикНастроек);
	
	Если МассивПолей[0].Значение = "ВЫРУЧКА от реализации" Тогда // Для выручки
		
		Возврат МассивПолей;
		
	Иначе  														// Для счетов
		
		Если МассивПолей.Количество() < 3 Тогда
		
			ЗначениеПоля = Новый ЗначенияПолейРасшифровкиКомпоновкиДанных;
			
			Строка          = ЗначениеПоля.Добавить();
			Строка.Поле     = "СтатьяЗатрат";
			Строка.Значение = null;
			Строка.Иерархия = Истина;
			МассивПолей.Вставить(0, Строка);
			
	    КонецЕсли;
		
	
		Возврат МассивПолей;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СформироватьНастройкиСКД(Расшифровка)
	
	ДанныеРасшифровкиОбъект = ПолучитьДанныеРасшифровки(Расшифровка);
	
	Если ДанныеРасшифровкиОбъект[0].Значение = "ВЫРУЧКА от реализации" Тогда
		Настройки = СформироватьНастройкиДляВыручки(ДанныеРасшифровкиОбъект);
		Возврат Настройки;
	Иначе
		Настройки = СформироватьНастройкиДляСчетов(ДанныеРасшифровкиОбъект);
		Возврат Настройки;
	КонецЕсли;
		
КонецФункции

Функция СформироватьНастройкиДляВыручки(ДанныеРасшифровкиОбъект)
	
	ТабДокРасшифровки = Новый ТабличныйДокумент;
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных = ОбъектОтчет.ПолучитьМакет("СКДКарточкаВыручки");
	
	//устанавливаем параметры
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Настройки.ПараметрыДанных.Элементы[0].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала;
	Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
	Настройки.ПараметрыДанных.Элементы[1].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания;
	Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
	Настройки.ПараметрыДанных.Элементы[2].Значение = ДанныеРасшифровкиОбъект[1].Значение;
	Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
	Настройки.ДополнительныеСвойства.Вставить("ВариантРасшифровки", "Выручка");
	
	Возврат Настройки;

КонецФункции 

Функция СформироватьНастройкиДляСчетов(ДанныеРасшифровкиОбъект)
	
	ТабДокРасшифровки = Новый ТабличныйДокумент;
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных = ОбъектОтчет.ПолучитьМакет("СКДКарточкаСчета");
	
	//устанавливаем параметры
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Настройки.ПараметрыДанных.Элементы[0].Значение = ДанныеРасшифровкиОбъект[2].Значение;
	Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
	Настройки.ПараметрыДанных.Элементы[1].Значение = ДанныеРасшифровкиОбъект[0].Значение;
	Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
	Настройки.ПараметрыДанных.Элементы[2].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания;
	Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
	Настройки.ПараметрыДанных.Элементы[3].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала;
	Настройки.ПараметрыДанных.Элементы[3].Использование = Истина;
	Настройки.ПараметрыДанных.Элементы[4].Значение = ДанныеРасшифровкиОбъект[1].Значение;
	Настройки.ПараметрыДанных.Элементы[4].Использование = Истина;
	ВидыСубконто = Новый СписокЗначений;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	Настройки.ПараметрыДанных.Элементы[5].Значение = ВидыСубконто;
	Настройки.ПараметрыДанных.Элементы[5].Использование = Истина;
	
	Если Не ЗначениеЗаполнено(Настройки.ПараметрыДанных.Элементы[1].Значение) Тогда
		Настройки.ПараметрыДанных.Элементы[6].Значение = Истина;
		Настройки.ПараметрыДанных.Элементы[6].Использование = Истина;
	КонецЕсли;
	
	Настройки.ДополнительныеСвойства.Вставить("ВариантРасшифровки", "Счета");
	
	Возврат Настройки;

КонецФункции 

 


