
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ТабДокРасшифровки = Новый ТабличныйДокумент;
	
	ОбъектОтчет = РеквизитФормыВЗначение("ОтчетРасшифровка");
	
	СхемаКомпоновкиДанных = ОбъектОтчет.ПолучитьМакет("СКДКарточкаСчета");                 
		
	ДанныеРасшифровкиДанных = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Параметры.НастройкиСкд, ДанныеРасшифровкиДанных);
	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ,ДанныеРасшифровкиДанных);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДокРасшифровки);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	РезультатРасшифровка = ТабДокРасшифровки;
	
	ДанныеРасшифровкиРасшифровка = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиДанных, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры 

&НаСервере
Функция РезультатРасшифровкаОбработкаРасшифровкиНаСервере(Расшифровка)
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровкиРасшифровка);
	Элемент = Данные.Элементы[Расшифровка].ПолучитьПоля();
	Возврат Элемент[0].Значение;
КонецФункции

&НаКлиенте
Процедура РезультатРасшифровкаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
 
  	СтандартнаяОбработка = Ложь;
	ЗначениеСсылка = РезультатРасшифровкаОбработкаРасшифровкиНаСервере(Расшифровка);
	ОткрытьЗначение(ЗначениеСсылка);
КонецПроцедуры



