&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	ВыбранныйЭлементКолонка = ""; 
	

	ШагВОтчете = 4;
	СуммаПлан = 2;
	СуммаФакт = 3;
	РазницаСуммаМакет = 4;
	РазницаПроцентМакет = 5;
	
	
	Пока РазницаПроцентМакет <> Элемент.ТекущаяОбласть.Лево ИЛИ РазницаСуммаМакет <> Элемент.ТекущаяОбласть.Лево Цикл
		
		Если Элемент.ТекущаяОбласть.Лево = РазницаПроцентМакет ИЛИ Элемент.ТекущаяОбласть.Лево = РазницаСуммаМакет Тогда
			
			Сообщить("Невозможно сделать расшифровку по разницам!");
			Возврат;
			
		КонецЕсли;
		
		
		Если РазницаПроцентМакет > Элемент.ТекущаяОбласть.Лево ИЛИ РазницаСуммаМакет > Элемент.ТекущаяОбласть.Лево Тогда
			
			Прервать;
			
		КонецЕсли;
		
		РазницаПроцентМакет = РазницаПроцентМакет + ШагВОтчете;
		РазницаСуммаМакет = РазницаСуммаМакет + ШагВОтчете;
		
		
	КонецЦикла;
	
	
	Пока СуммаПлан = Элемент.ТекущаяОбласть.Лево ИЛИ СуммаФакт = Элемент.ТекущаяОбласть.Лево Цикл
		
		Если СуммаПлан = Элемент.ТекущаяОбласть.Лево Тогда
			
			ВыбранныйЭлементКолонка = "СуммаПлан";
			
		ИначеЕсли СуммаФакт = Элемент.ТекущаяОбласть.Лево Тогда
			
			ВыбранныйЭлементКолонка = "СуммаФакт";			
			
		КонецЕсли;
		
		Если СуммаПлан > Элемент.ТекущаяОбласть.Лево ИЛИ СуммаФакт > Элемент.ТекущаяОбласть.Лево Тогда
			
			Прервать;
			
		КонецЕсли;
		
		СуммаПлан = СуммаПлан + ШагВОтчете;
		СуммаФакт = СуммаФакт + ШагВОтчете;
	
	КонецЦикла;
	
	
    НастройкиСкд = СформироватьНастройкиСКД(Расшифровка, ВыбранныйЭлементКолонка); 
	ПараметрыФормыРасшифровки = Новый Структура("настройкиСкд", НастройкиСкд);
	ПараметрыФормыРасшифровки.Вставить("НаименованиеКолонки", ВыбранныйЭлементКолонка); 
	
	Если НастройкиСкд = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НастройкиСкд.ДополнительныеСвойства.ВариантРасшифровки = "Выручка"  Тогда
		
		ОткрытьФорму("ВнешнийОтчет.ОтчетБДР_ПланФакт.Форма.ФормаРасшифровкиВыручка", ПараметрыФормыРасшифровки,,,,,);
		
	иначе          
		
		ОткрытьФорму("ВнешнийОтчет.ОтчетБДР_ПланФакт.Форма.ФормаРасшифровкиСчета", ПараметрыФормыРасшифровки,,,,,);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеРасшифровки(Расшифровка)
	
	ДанныеРасшифровкиОбъект = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 
	МассивПолей = БухгалтерскиеОтчетыВызовСервера.ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровкиОбъект, Отчет.КомпоновщикНастроек);
	
	Если МассивПолей[0].Значение = "ВЫРУЧКА от реализации" Тогда // Для выручки
		
		Возврат МассивПолей;
		
	Иначе  														// Для счетов
		
		Если МассивПолей.Количество() < 3 Тогда
		
			ЗначениеПоля = Новый ЗначенияПолейРасшифровкиКомпоновкиДанных;
			
			Строка          = ЗначениеПоля.Добавить();
			Строка.Поле     = "СтатьяЗатрат";
			Строка.Значение = null;
			Строка.Иерархия = Истина;
			МассивПолей.Вставить(0, Строка);
			
	    КонецЕсли;
		
	
		Возврат МассивПолей;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СформироватьНастройкиСКД(Расшифровка, НаименованиеКолонкиЯчейки = "")
	
	ДанныеРасшифровкиОбъект = ПолучитьДанныеРасшифровки(Расшифровка);
	
	Если ДанныеРасшифровкиОбъект[0].Значение = "ВЫРУЧКА от реализации" Тогда
		Настройки = СформироватьНастройкиДляВыручки(ДанныеРасшифровкиОбъект);
		Возврат Настройки;
	Иначе
		Настройки = СформироватьНастройкиДляСчетов(ДанныеРасшифровкиОбъект, НаименованиеКолонкиЯчейки);
		Возврат Настройки;
	КонецЕсли;
		
КонецФункции

Функция СформироватьНастройкиДляВыручки(ДанныеРасшифровкиОбъект)
	
	ТабДокРасшифровки = Новый ТабличныйДокумент;
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных = ОбъектОтчет.ПолучитьМакет("СКДКарточкаВыручки");
	
	//устанавливаем параметры
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Настройки.ПараметрыДанных.Элементы[0].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала;
	Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
	Настройки.ПараметрыДанных.Элементы[1].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания;
	Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
	Настройки.ПараметрыДанных.Элементы[2].Значение = ДанныеРасшифровкиОбъект[0].Значение;
	Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
	Настройки.ДополнительныеСвойства.Вставить("ВариантРасшифровки", "Выручка");
	
	Возврат Настройки;

КонецФункции 

&НаСервере
Функция СформироватьНастройкиДляСчетов(ДанныеРасшифровкиОбъект, НаименованиеКолонки = "")
	
	ТабДокРасшифровки = Новый ТабличныйДокумент;
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	
	Если НаименованиеКолонки = "СуммаФакт" Тогда
		
		СхемаКомпоновкиДанных = ОбъектОтчет.ПолучитьМакет("СКДКарточкаСчетаФакт");
		
	Иначе
		
		СхемаКомпоновкиДанных = ОбъектОтчет.ПолучитьМакет("СКДКарточкаСчетаПлан");
		
	КонецЕсли;
	
	
	
	//СхемаКомпоновкиДанных = ОбъектОтчет.ПолучитьМакет("СКДКарточкаСчетаФакт");
	
	//устанавливаем параметры
	
	//Если ДанныеРасшифровкиОбъект.Количество() = 2 Тогда
	//	
	//	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	//	Настройки.ПараметрыДанных.Элементы[0].Значение = ДанныеРасшифровкиОбъект[1].Значение;
	//	Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
	//	Настройки.ПараметрыДанных.Элементы[1].Значение = ДанныеРасшифровкиОбъект[0].Значение; //0
	//	Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
	//	Настройки.ПараметрыДанных.Элементы[2].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания;
	//	Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
	//	Настройки.ПараметрыДанных.Элементы[3].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала;
	//	Настройки.ПараметрыДанных.Элементы[3].Использование = Истина;
	//	ВидыСубконто = Новый СписокЗначений;
	//	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	//	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	//	Настройки.ПараметрыДанных.Элементы[5].Значение = ВидыСубконто;
	//	Настройки.ПараметрыДанных.Элементы[5].Использование = Истина;
	//	
	//	Если Не ЗначениеЗаполнено(Настройки.ПараметрыДанных.Элементы[1].Значение) Тогда
	//		Настройки.ПараметрыДанных.Элементы[6].Значение = Истина;
	//		Настройки.ПараметрыДанных.Элементы[6].Использование = Истина;
	//	КонецЕсли;
	//	
	//	Настройки.ДополнительныеСвойства.Вставить("ВариантРасшифровки", "Счета");
	//	
	//Иначе
	//	
	//	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	//	Настройки.ПараметрыДанных.Элементы[0].Значение = ДанныеРасшифровкиОбъект[2].Значение;
	//	Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
	//	Настройки.ПараметрыДанных.Элементы[1].Значение = ДанныеРасшифровкиОбъект[0].Значение; //0
	//	Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
	//	Настройки.ПараметрыДанных.Элементы[2].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания;
	//	Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
	//	Настройки.ПараметрыДанных.Элементы[3].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала;
	//	Настройки.ПараметрыДанных.Элементы[3].Использование = Истина;
	//	Настройки.ПараметрыДанных.Элементы[4].Значение = ДанныеРасшифровкиОбъект[1].Значение; //1
	//	Настройки.ПараметрыДанных.Элементы[4].Использование = Истина;
	//	ВидыСубконто = Новый СписокЗначений;
	//	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	//	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	//	Настройки.ПараметрыДанных.Элементы[5].Значение = ВидыСубконто;
	//	Настройки.ПараметрыДанных.Элементы[5].Использование = Истина;
	//	
	//	Если Не ЗначениеЗаполнено(Настройки.ПараметрыДанных.Элементы[1].Значение) Тогда
	//		Настройки.ПараметрыДанных.Элементы[6].Значение = Истина;
	//		Настройки.ПараметрыДанных.Элементы[6].Использование = Истина;
	//	КонецЕсли;
	//	
	//	Настройки.ДополнительныеСвойства.Вставить("ВариантРасшифровки", "Счета");	
	//	
	//КонецЕсли;
	
	Если ДанныеРасшифровкиОбъект.Количество() < 3 ИЛИ НЕ ЗначениеЗаполнено(ДанныеРасшифровкиОбъект[0].Значение) Тогда
		
		Сообщить("Невозможно сделать расшифровку по проектам и статьям затрат!");
		
	Иначе
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		Настройки.ПараметрыДанных.Элементы[0].Значение = ДанныеРасшифровкиОбъект[2].Значение;
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ДанныеРасшифровкиОбъект[0].Значение;
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания;
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[3].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала;
		Настройки.ПараметрыДанных.Элементы[3].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[4].Значение = ДанныеРасшифровкиОбъект[1].Значение;
		Настройки.ПараметрыДанных.Элементы[4].Использование = Истина;
		ВидыСубконто = Новый СписокЗначений;
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
		Настройки.ПараметрыДанных.Элементы[5].Значение = ВидыСубконто;
		Настройки.ПараметрыДанных.Элементы[5].Использование = Истина;
		
		Если Не ЗначениеЗаполнено(Настройки.ПараметрыДанных.Элементы[1].Значение) Тогда
			Настройки.ПараметрыДанных.Элементы[6].Значение = Истина;
			Настройки.ПараметрыДанных.Элементы[6].Использование = Истина;
		КонецЕсли;
		
		Настройки.ДополнительныеСвойства.Вставить("ВариантРасшифровки", "Счета");
		
		Возврат Настройки;	
		
	КонецЕсли;
	
	//Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	//Настройки.ПараметрыДанных.Элементы[0].Значение = ДанныеРасшифровкиОбъект[2].Значение;
	//Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
	//Настройки.ПараметрыДанных.Элементы[1].Значение = ДанныеРасшифровкиОбъект[0].Значение;
	//Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
	//Настройки.ПараметрыДанных.Элементы[2].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания;
	//Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
	//Настройки.ПараметрыДанных.Элементы[3].Значение = ОбъектОтчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала;
	//Настройки.ПараметрыДанных.Элементы[3].Использование = Истина;
	//Настройки.ПараметрыДанных.Элементы[4].Значение = ДанныеРасшифровкиОбъект[1].Значение;
	//Настройки.ПараметрыДанных.Элементы[4].Использование = Истина;
	//ВидыСубконто = Новый СписокЗначений;
	//ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	//ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	//Настройки.ПараметрыДанных.Элементы[5].Значение = ВидыСубконто;
	//Настройки.ПараметрыДанных.Элементы[5].Использование = Истина;
	//
	//Если Не ЗначениеЗаполнено(Настройки.ПараметрыДанных.Элементы[1].Значение) Тогда
	//	Настройки.ПараметрыДанных.Элементы[6].Значение = Истина;
	//	Настройки.ПараметрыДанных.Элементы[6].Использование = Истина;
	//КонецЕсли;
	//
	//Настройки.ДополнительныеСвойства.Вставить("ВариантРасшифровки", "Счета");
	//
	//Возврат Настройки;

КонецФункции 

 


